[
{"name": "Ikura Maki", "description": "Ikura is almost always prepared as gunkan-maki, in which a short strip of nori (seaweed) is wrapped around the shari (sushi rice). It is nearly impossible to prepare as nigiri, but can be prepared this way if part of the sujiko is left intact. When the gunkan is ready, scoop a portion of the ikura to fill the top.", "price": "2.99", "imageName": "Ikura Maki"}, {"name": "Amaebi", "description": "Amaebi Sushi. Amaebi, or spot prawns, (colloquially known as sweet shrimp) are cold water northern shrimp known and named for their sweet taste. They are the only species of shrimp which are best enjoyed raw, as cooking them will rob them of their full sweetness.", "price": "6.99", "imageName": "Amaebi"}, {"name": "Anago", "description": "Anago sushi is a type of sushi where eel, simmered and cut into a fillet, is placed on top of vinegared rice and brushed with a sauce called tsume. During the Edo period, Tokyo Bay was an excellent environment for fish farming due to nutrient-rich water flowing in from various rivers.", "price": "4.99", "imageName": "Anago"}, {"name": "California", "description": "It is a variation of the traditional Japanese sushi rolls, known as “makizushi.” Unlike traditional sushi rolls, the California roll does not use raw fish as its main ingredient. Instead, it features avocado, imitation crab (also called kani), cucumber, and sushi rice, all wrapped in a sheet of nori (seaweed).", "price": "1.99", "imageName": "California"}, {"name": "Cappa Maki", "description": "Kappa maki is a simple sushi roll (maki) made with cucumber encased in sushi rice and dried seaweed. It is one of a handful of sushi recipes that is entirely vegetarian. And although a kappa roll is simple to make – with a super short list of ingredients – it has the perfect balance of flavors and textures.", "price": "8.99", "imageName": "Cappa Maki"}, {"name": "Ebi", "description": "Ebi refers to a style of preparing shrimp in Japan. Traditionally, you prepare the shrimp by “butterflying” them- That means that they are split open from the bottom and laid out flat. Butterfly shrimp can be use on maki, but it was originally used on nigiri.", "price": "5.99", "imageName": "Ebi"}, {"name": "Ebiko Maki", "description": "Ebiko is made by peeling and finely chopping boiled small shrimp (Akaebi) with a knife, and then sweetening and stir-frying them with sugar, mirin, sake, etc. Some people use a mortar and pestle instead of a knife. In the past, it was commonly made at home and is also known as ebioboro. It is often used in rolled sushi, particularly in the local style of rolled sushi that includes grilled conger eel, ebiko, asari (clams), thick grilled egg, shiitake mushrooms, kanpyo (dried gourd strips), and mitsuba (Japanese parsley), rolled with nori (seaweed) and vinegared rice. Additionally, it can be found in chirashi sushi served at events such as ceremonies and celebrations by sushi restaurants in the region.", "price": "6.99", "imageName": "Ebiko Maki"}, {"name": "Futo Maki", "description": "Futomaki (太巻き) is the most classic sushi roll in Japan. Therefore, when you say Maki Sushi (巻き寿司) or sushi roll, it implies Futomaki. With its attractive look, Futomaki is a popular sushi roll to make for festivity events, holidays, potluck, or bento.", "price": "3.99", "imageName": "Futo Maki"}, {"name": "Hashi", "description": "Chopsticks are smoothed, and frequently tapered. They are traditionally made of wood, bamboo, metal, ivory, and ceramics, and in modern days, increasingly available in non-traditional materials such as plastic, stainless steel, and even titanium. Chopsticks are often seen as requiring practice and skill to master to be used as an eating utensil. In some countries, failing to follow etiquette in their use is frowned upon, though such feelings are generally lesser than they once were.", "price": "1.99", "imageName": "Hashi"}, {"name": "Inari Maki", "description": "Inari sushi is made by filling a pouch of seasoned fried tofu with sushi rice. It is named after the Shinto god Inari, who is said to have had a fondness for tofu. These tofu pouches are a portable, healthy, everyday vegetarian and vegan dish.", "price": "6.99", "imageName": "Inari Maki"}, {"name": "Maguro", "description": "The taste of maguro sushi or sashimi depends on the species of tuna and the part of the body from which the meat is taken. In general, the tuna meat is very tender and has an intense taste. Meat that comes from the center of the body is dark red, shiny and very lean, it is called akami (赤身) in Japanese.", "price": "7.99", "imageName": "Maguro"}, {"name": "Nikuman", "description": "Nikuman is a steamed bun with meat filling wrapped by white fluffy skin. The ingredients are finely chopped pork meat, onion and shiitake mushrooms. The soft texture of meat and juicy gravy make it appealing. It tastes good as is or is eaten with sauce and mustard depending on the shop.", "price": "4.99", "imageName": "Nikuman"}, {"name": "Onigiri", "description": "Despite common misconceptions, onigiri is not a form of sushi and should not be confused with the type of sushi called nigirizushi or simply nigiri. Onigiri is made with plain rice (sometimes lightly salted), while sushi is made of rice with vinegar, sugar and salt.", "price": "8.99", "imageName": "Onigiri"}, {"name": "Sake", "description": "Sake-rui (サケ類) is the Japanese generic term for fishes belonging to the family of salmonids. In a narrower sense, the Japanese term sake refers to the pacific salmons, especially to chuma salmon (shirosake, シロザケ), in a broader sense, the term refers to a category of salmon fish that bear the term sake in their name and whose meat is similar in color and texture to that of chum salmon. Traditionally, these fish have been classified as belonging to the sake group if they spend most of their lives in salt water.", "price": "5.99", "imageName": "Sake"}, {"name": "Salmon Maki", "description": "It is often the first piece of sushi you eat when you first enter a Japanese restaurant. This maki is easy to make ánd it's just so delicious! This maki is a classic roll of delicious sushi rice filled with raw fresh salmon and wrapped in a nori sheet.", "price": "9.99", "imageName": "Salmon Maki"}, {"name": "Soy", "description": "Soy sauce goes with sushi like butter with bread. You don't necessarily need it, but it definitely enhances the flavor and balances out the overall taste. The salty and umami-filled sauce contrasts the sweet sushi rice and richness of the fish, making it a traditional pairing dating back centuries", "price": "3.99", "imageName": "Soy"}, {"name": "Sushi Rice", "description": "Technically, 'sushi rice' is cooked rice flavoured with vinegar and seasoning, not raw rice. The rice used to make sushi is short-grain, but a specific type that has a unique flavour to other short-grained rice and behaves differently when cooked.", "price": "6.99", "imageName": "Sushi Rice"}, {"name": "Sushi Stand", "description": "A sushi bar is a Japanese restaurant that specializes in serving sushi, sashimi, and other Japanese dishes. It typically features a counter where customers can sit and watch the sushi chefs prepare their food. The focus is on providing fresh, high-quality seafood and creating an interactive dining experience.", "price": "10.99", "imageName": "Sushi Stand"}, {"name": "Taiyaki", "description": "Taiyaki is a kind of snack from Tokyo, Japan. It mainly uses flour, sugar, milk and baking soda as ingredients, and it is made into wagashi shaped like snapper. Tai means snapper, and yaki means barbecue", "price": "3.99", "imageName": "Taiyaki"}, {"name": "Te Maki", "description": "Temaki is sushi in the hand roll form, otherwise known as hand roll sushi. Typically they are made from vinegared rice and sashimi (raw fish), veggies, or other fillings enclosed in a nori (seaweed) cone.", "price": "5.99", "imageName": "Te Maki"}, {"name": "Tekka Maki", "description": "TEKKA MAKI? In Japanese, a sushi roll is called maki or makizushi – and is typically a fish or a vegetable wrapped in Japanese rice and dried seaweed sheet, then cut. In this case, we're using fresh tuna sashimi – sometimes referred to as tekka. Therefore this tuna roll is called tekka maki in Japanese.", "price": "7.99", "imageName": "Tekka Maki"}, {"name": "Toro", "description": "It is considered one of the most prized items on a sushi menu due to its unique taste and texture. Toro sushi is made from the fatty belly part of the bluefin tuna fish, which is known for its marbled appearance and buttery flavor.", "price": "8.99", "imageName": "Toro"}, {"name": "Umeshiso Maki", "description": "It's a simple maki roll with two fillings; umeboshi pickled plums and fresh shiso leaves. The saltiness of the plum contrasts nicely with the freshness of the shiso. It's also very easy to make at home.", "price": "6.99", "imageName": "Umeshiso Maki"}, {"name": "Wasabi", "description": "The tiny ball of green paste on your plate of sushi is, unfortunately, not authentic wasabi. It’s actually a mixture of horseradish, mustard powder, and green food coloring. Unless you absolutely must try authentic wasabi (and I do recommend trying it!), the horseradish and mustard substitute works just as well. You can find premixed powder in most Asian supermarkets for a good price and it only takes a minute to make it!", "price": "5.99", "imageName": "Wasabi"}
]